function check() {
    if(f1.r1.value =="Сократу"){
        alert("Правильно!")
    }
    else{
        alert ("Неправильно! Правильный ответ: Сократу")
    }
}

function check1() {
    if(f2.r2.value =="Аристотель"){
        alert("Правильно!")
    }
    else{
        alert ("Неправильно! Правильный ответ: Аристотель")
    }
}

function check2() {
    if(f3.r3.value =="Поступай так, чтобы максима твоего поступка посредством твоей воли могла стать принципом всеобщего законодательства"){
        alert("Правильно!")
    }
    else{
        alert ("Неправильно! Правильный ответ: Поступай так, чтобы максима твоего поступка посредством твоей воли могла стать принципом всеобщего законодательства")
    }
}

function check3() {
    if(f4.r4.value =="Зигмунд Фрейд"){
        alert("Правильно!")
    }
    else{
        alert ("Неправильно! Правильный ответ: Зигмунд Фрейд")
    }
}

function check4() {
    if(f5.r5.value =="Карл Маркс"){
        alert("Правильно!")
    }
    else{
        alert ("Неправильно! Правильный ответ: Карл Маркс")
    }
}